tutorials/movingMeshRhoPimpleDyMFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    sides
    {
        type            patch;
        physicalType    patch;
        nFaces          722;
        startFace       11670;
    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          19;
        startFace       12392;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          19;
        startFace       12411;
    }
    bottom
    {
        type            patch;
        physicalType    patch;
        nFaces          19;
        startFace       12430;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          19;
        startFace       12449;
    }
)

// ************************************************************************* //
